---
kind: type
id: T:Autodesk.Revit.DB.EdgeArray
source: html/7069d0a1-fc52-a347-e0d8-6de1f40797d3.htm
---
# Autodesk.Revit.DB.EdgeArray

An array that contains edges.

## Syntax (C#)
```csharp
public class EdgeArray : APIObject, IEnumerable
```